{
  "_name_or_path": "neuralmind/bert-base-portuguese-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ADJ",
    "1": "ADV",
    "2": "ADV-KS",
    "3": "ART",
    "4": "CUR",
    "5": "IN",
    "6": "KC",
    "7": "KS",
    "8": "N",
    "9": "NPROP",
    "10": "NUM",
    "11": "PCP",
    "12": "PDEN",
    "13": "PREP",
    "14": "PREP+ADV",
    "15": "PREP+ART",
    "16": "PREP+PRO-KS",
    "17": "PREP+PROADJ",
    "18": "PREP+PROPESS",
    "19": "PREP+PROSUB",
    "20": "PRO-KS",
    "21": "PROADJ",
    "22": "PROPESS",
    "23": "PROSUB",
    "24": "PU",
    "25": "V"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ADJ": 0,
    "ADV": 1,
    "ADV-KS": 2,
    "ART": 3,
    "CUR": 4,
    "IN": 5,
    "KC": 6,
    "KS": 7,
    "N": 8,
    "NPROP": 9,
    "NUM": 10,
    "PCP": 11,
    "PDEN": 12,
    "PREP": 13,
    "PREP+ADV": 14,
    "PREP+ART": 15,
    "PREP+PRO-KS": 16,
    "PREP+PROADJ": 17,
    "PREP+PROPESS": 18,
    "PREP+PROSUB": 19,
    "PRO-KS": 20,
    "PROADJ": 21,
    "PROPESS": 22,
    "PROSUB": 23,
    "PU": 24,
    "V": 25
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
